hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_radio.h
    @param[in] radio_task Requested task.

    @return Address of the specified task register.
*/
__STATIC_INLINE uint32_t nrf_radio_task_address_get(nrf_radio_task_t radio_task);

/**
    @brief Function for clearing a specific RADIO event.

    @param[in] radio_event Event to clean.
*/
__STATIC_INLINE void nrf_radio_event_clear(nrf_radio_event_t radio_event);

/**
    @brief Function for checking the state of a specific RADIO event.

    @param[in] radio_event Event to check.

    @retval true  If the event is set.
    @retval false If the event is not set.
*/
__STATIC_INLINE bool nrf_radio_event_check(nrf_radio_event_t radio_event);

/**
    @brief Function for getting the address of a specific RADIO event register.

    This function can be used by the PPI module.

    @param[in] radio_event Requested Event.

    @return Address of the specified event register.
*/
__STATIC_INLINE uint32_t nrf_radio_event_address_get(nrf_radio_event_t radio_event);

/**
    @brief Function for enabling specified RADIO shortcuts.

    @param[in] radio_shorts_mask Mask of shortcuts.

*/
__STATIC_INLINE void nrf_radio_shorts_enable(uint32_t radio_shorts_mask);

/**
    @brief Function for disabling specified RADIO shortcuts.

    @param[in] radio_shorts_mask Mask of shortcuts.
*/
__STATIC_INLINE void nrf_radio_shorts_disable(uint32_t radio_shorts_mask);

/**
    @brief Function for setting the configuration of RADIO shortcuts.

    @param[in] radio_shorts_mask Shortcuts configuration to set.
*/
__STATIC_INLINE void nrf_radio_shorts_set(uint32_t radio_shorts_mask);

/**
    @brief Function for getting the configuration of RADIO shortcuts.

    @return Mask of currently enabled shortcuts.
*/
__STATIC_INLINE uint32_t nrf_radio_shorts_get(void);

/**
    @brief Function for enabling specified RADIO interrupts.

    @param[in] radio_int_mask Mask of interrupts.
*/
__STATIC_INLINE void nrf_radio_int_enable(uint32_t radio_int_mask);

/**
    @brief Function for disabling specified RADIO interrupts.

    @param[in] radio_int_mask Mask of interrupts.
*/
__STATIC_INLINE void nrf_radio_int_disable(uint32_t radio_int_mask);

/**
    @brief Function for getting the state of a specific interrupt.

    @param[in] radio_int_mask Interrupt to check.

    @retval true  If the interrupt is enabled.
    @retval false If the interrupt is not enabled.
*/
__STATIC_INLINE bool nrf_radio_int_enable_check(nrf_radio_int_mask_t radio_int_mask);

/**
    @brief Function for getting CRC status of last received packet.

    @retval true  If the packet was received without CRC error .
    @retval false If the packet was received with CRC error.
*/
__STATIC_INLINE bool nrf_radio_crc_status_check(void);

/**
    @brief Function for getting the received address.

    @return Received address.
*/
__STATIC_INLINE uint8_t nrf_radio_rxmatch_get(void);

/**
    @brief Function for getting CRC field of the last received packet.

    @return CRC field of previously received packet.
*/
__STATIC_INLINE uint32_t nrf_radio_rxcrc_get(void);

/**
    @brief Function for getting the device address match index.

    @return Device adress match index.
*/
__STATIC_INLINE uint8_t nrf_radio_dai_get(void);

#if defined(RADIO_PDUSTAT_PDUSTAT_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for getting status on payload length.

    @retval 0 If the payload is lesser than PCNF1.MAXLEN.
    @retval 1 If the payload is greater than PCNF1.MAXLEN.
*/
__STATIC_INLINE uint8_t nrf_radio_pdustat_get(void);

/**
    @brief Function for getting status on what rate packet is received with in Long Range.

    @retval 0 If the frame is received at 125kbps.
    @retval 1 If the frame is received at 500kbps.
*/
__STATIC_INLINE uint8_t nrf_radio_cistat_get(void);
#endif // defined(RADIO_PDUSTAT_PDUSTAT_Msk) || defined(__NRFX_DOXYGEN__)

/**
    @brief Function for setting packet pointer to given location in memory.

    @param[in] p_packet Packet pointer.
*/
__STATIC_INLINE void nrf_radio_packetptr_set(const void *p_packet);

/**
    @brief Function for getting packet pointer.

    @return Pointer to tx or rx packet buffer.
*/
__STATIC_INLINE void *nrf_radio_packetptr_get(void);

/**
    @brief Function for setting the radio frequency.

    @param[in] radio_frequency Frequency in MHz.
*/
__STATIC_INLINE void nrf_radio_frequency_set(uint16_t radio_frequency);

/**
    @brief Function for getting the radio frequency.

    @return Frequency in MHz.
*/
__STATIC_INLINE uint16_t nrf_radio_frequency_get(void);

/**
    @brief Function for setting the radio transmit power.

    @param[in] tx_power Transmit power of the radio [dBm].
*/
__STATIC_INLINE void nrf_radio_txpower_set(nrf_radio_txpower_t tx_power);

/**
    @brief Function for getting the radio transmit power.

    @return Transmit power of the radio.
*/
__STATIC_INLINE nrf_radio_txpower_t nrf_radio_txpower_get(void);

/**
    @brief Function for setting the radio data rate and modulation settings.

    @param[in] radio_mode Radio data rate and modulation.
*/
__STATIC_INLINE void nrf_radio_mode_set(nrf_radio_mode_t radio_mode);

/**
    @brief Function for getting Radio data rate and modulation settings.

    @return Radio data rate and modulation.
*/
__STATIC_INLINE nrf_radio_mode_t nrf_radio_mode_get(void);

/**
    @brief Function for setting the packet configuration.

    @param[in] p_config Pointer to the structure with packet configuration.
*/
__STATIC_INLINE void nrf_radio_packet_configure(const nrf_radio_packet_conf_t *p_config);

/**
    @brief Function for setting the base address 0.

    @param address Base address 0 value.
*/
__STATIC_INLINE void nrf_radio_base0_set(uint32_t address);

/**
    @brief Function for getting the base address 0.

    @return Base address 0.
*/
__STATIC_INLINE uint32_t nrf_radio_base0_get(void);

/**
    @brief Function for setting Base address 1.

    @param address Base address 1 value.
*/
__STATIC_INLINE void nrf_radio_base1_set(uint32_t address);

/**
    @brief Function for getting base address 1.

