hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_radio.h
    @return Base address 1.
*/
__STATIC_INLINE uint32_t nrf_radio_base1_get(void);

/**
    @brief Function for setting prefixes bytes for logical addresses 0-3.

    @param prefixes Prefixes bytes for logical addresses 0-3.
*/
__STATIC_INLINE void nrf_radio_prefix0_set(uint32_t prefixes);

/**
    @brief Function for getting prefixes bytes for logical addresses 0-3

    @return Prefixes bytes for logical addresses 0-3
*/
__STATIC_INLINE uint32_t nrf_radio_prefix0_get(void);

/**
    @brief Function for setting prefixes bytes for logical addresses 4-7.

    @param prefixes Prefixes bytes for logical addresses 4-7.
*/
__STATIC_INLINE void nrf_radio_prefix1_set(uint32_t prefixes);

/**
    @brief Function for getting prefixes bytes for logical addresses 4-7

    @return Prefixes bytes for logical addresses 4-7
*/
__STATIC_INLINE uint32_t nrf_radio_prefix1_get(void);

/**
    @brief Function for setting the transmit address.

    @param txaddress Logical address to be used when transmitting a packet.
*/
__STATIC_INLINE void nrf_radio_txaddress_set(uint8_t txaddress);

/**
    @brief Function for getting the transmit address select.

    @return Logical address to be used when transmitting a packet.
*/
__STATIC_INLINE uint8_t nrf_radio_txaddress_get(void);

/**
    @brief Function for for selecting the receive addresses.

    @param rxaddresses Enable or disable reception on logical address i.
                      Read more in the Product Specification.
*/
__STATIC_INLINE void nrf_radio_rxaddresses_set(uint8_t rxaddresses);

/**
    @brief Function for getting receive address select.

    @return Receive address select.
*/
__STATIC_INLINE uint8_t nrf_radio_rxaddresses_get(void);

/**
    @brief Function for configure CRC.

    @param[in] crc_length      CRC length in number of bytes [0-3].
    @param[in] crc_address     Include or exclude packet address field out of CRC.
    @param[in] crc_polynominal CRC polynominal to set.
*/
__STATIC_INLINE void nrf_radio_crc_configure(uint8_t              crc_length,
                                             nrf_radio_crc_addr_t crc_address,
                                             uint32_t             crc_polynominal);
                                             
/**
    @brief Function for setting CRC initial value.

    @param crc_init_value CRC initial value
*/
__STATIC_INLINE void nrf_radio_crcinit_set(uint32_t crc_init_value);

/**
    @brief Function for getting CRC initial value.

    @return CRC initial value.
*/
__STATIC_INLINE uint32_t nrf_radio_crcinit_get(void);

/**
    @brief Function for setting Inter Frame Spacing interval.

    @param[in] radio_ifs Inter frame spacing interval [us].
*/
__STATIC_INLINE void nrf_radio_ifs_set(uint32_t radio_ifs);

/**
    @brief Function for getting Inter Frame Spacing interval.

    @return Inter frame spacing interval [us].
*/
__STATIC_INLINE uint32_t nrf_radio_ifs_get(void);

/**
    @brief Function for getting RSSI sample result.

    @note The read value is a positive value while the actual received signal
         is a negative value. Actual received signal strength is therefore as follows:
         received signal strength = - read_value dBm .

    @return RSSI sample result.
*/
__STATIC_INLINE uint8_t nrf_radio_rssi_sample_get(void);

/**
    @brief Function for getting the current state of the radio module.

    @return Current radio state.
*/
__STATIC_INLINE nrf_radio_state_t nrf_radio_state_get(void);

/**
    @brief Function for setting the data whitening initial value.

    @param datawhiteiv Data whitening initial value.
*/
__STATIC_INLINE void nrf_radio_datawhiteiv_set(uint8_t datawhiteiv);

/**
    @brief Function for getting the data whitening initial value.

    @return Data whitening initial value.
*/
__STATIC_INLINE uint8_t nrf_radio_datawhiteiv_get(void);

/**
    @brief Function for setting Bit counter compare.

    @param[in] radio_bcc Bit counter compare [bits].
*/
__STATIC_INLINE void nrf_radio_bcc_set(uint32_t radio_bcc);

/**
    @brief Function for getting Bit counter compare.

    @return Bit counter compare.
*/
__STATIC_INLINE uint32_t nrf_radio_bcc_get(void);

/**
    @brief Function for setting Device address base segment.

    @param dab_value Particular base segment value.
    @param segment   Index of the particular Device address base segment register.
*/
__STATIC_INLINE void nrf_radio_dab_set(uint32_t dab_value, uint8_t segment);

/**
    @brief Function for getting Device address base segment.

    @param segment Number of the Device address base segment.

    @return Particular segment of the Device address base.
*/
__STATIC_INLINE uint32_t nrf_radio_dab_get(uint8_t segment);

/**
    @brief Function for setting device address prefix.

    @param dap_value    Particular device address prefix value.
    @param prefix_index Index of the particular device address prefix register.
*/
__STATIC_INLINE void nrf_radio_dap_set(uint16_t dap_value, uint8_t prefix_index);

/**
    @brief Function for getting Device address prefix.

    @param prefix_index Number of the Device address prefix segment.

    @return Particular segment of the Device address prefix.
*/
__STATIC_INLINE uint32_t nrf_radio_dap_get(uint8_t prefix_index);

/**
    @brief Function for setting device address match configuration.

    @note Read more about configuring device address match in the Product Specification.

    @param ena   Device address matching bitmask.
    @param txadd TxAdd bitmask.
*/
__STATIC_INLINE void nrf_radio_dacnf_set(uint8_t ena, uint8_t txadd);

/**
    @brief Function for getting ENA field of the Device address match configuration register.

    @return ENA field of the Device address match configuration register.
*/
__STATIC_INLINE uint8_t nrf_radio_dacnf_ena_get(void);

/**
    @brief Function for getting TXADD field of the Device address match configuration register.

    @return TXADD field of the Device address match configuration register.
*/
__STATIC_INLINE uint8_t nrf_radio_dacnf_txadd_get(void);

