hananddong/ble_uwb_code/UWB_BLE_nrf52832/modules/nrfx/hal/nrf_radio.h
#if defined(RADIO_INTENSET_MHRMATCH_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for setting MAC Header Match Unit search pattern configuration.

    @param[in] radio_mhmu_search_pattern Search Pattern Configuration.
*/
__STATIC_INLINE void nrf_radio_mhmu_search_pattern_set(uint32_t radio_mhmu_search_pattern);

/**
    @brief Function for getting MAC Header Match Unit search pattern configuration.

    @return Search Pattern Configuration.
*/
__STATIC_INLINE uint32_t nrf_radio_mhmu_search_pattern_get(void);

/**
    @brief Function for setting MAC Header Match Unit pattern mask configuration.

    @param[in] radio_mhmu_pattern_mask Pattern mask.
*/
__STATIC_INLINE void nrf_radio_mhmu_pattern_mask_set(uint32_t radio_mhmu_pattern_mask);

/**
    @brief Function for getting MAC Header Match Unit pattern mask configuration.

    @return Pattern mask.
*/
__STATIC_INLINE uint32_t nrf_radio_mhmu_pattern_mask_get(void);
#endif // defined(RADIO_INTENSET_MHRMATCH_Msk) || defined(__NRFX_DOXYGEN__)

#if defined(RADIO_MODECNF0_RU_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for setting Radio mode configuration register 0.

    @param fast_ramp_up Use fast radio ramp-up time
    @param default_tx   Default TX value during inactivity.
*/
__STATIC_INLINE void nrf_radio_modecnf0_set(bool fast_ramp_up, uint8_t default_tx);

/**
    @brief Function for getting ramp-up time configuration of the Radio mode configuration register 0.

    @retval true  If the ramp-up time is set to fast.
    @retval false If the ramp-up time is set to default.
*/
__STATIC_INLINE bool nrf_radio_modecnf0_ru_get(void);

/**
    @brief Function for getting default TX value of the Radio mode configuration register 0.

    @return Default TX value.
*/
__STATIC_INLINE uint8_t nrf_radio_modecnf0_dtx_get(void);
#endif // defined(RADIO_MODECNF0_RU_Msk) || defined(__NRFX_DOXYGEN__)

#if defined(RADIO_SFD_SFD_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for setting IEEE 802.15.4 start of frame delimiter.

    @param sfd IEEE 802.15.4 start of frame delimiter.
*/
__STATIC_INLINE void nrf_radio_sfd_set(uint8_t sfd);

/**
    @brief Function for getting IEEE 802.15.4 start of frame delimiter.

    @return IEEE 802.15.4 start of frame delimiter.
*/
__STATIC_INLINE uint8_t nrf_radio_sfd_get(void);
#endif // defined(RADIO_SFD_SFD_Msk) || defined(__NRFX_DOXYGEN__)

#if defined(RADIO_EDCNT_EDCNT_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for setting number of iterations to perform ED scan.

    @param[in] ed_loop_count Number of iterations during ED procedure.
*/
__STATIC_INLINE void nrf_radio_ed_loop_count_set(uint32_t ed_loop_count);
#endif // defined(RADIO_EDCNT_EDCNT_Msk) || defined(__NRFX_DOXYGEN__)

#if defined(RADIO_EDSAMPLE_EDLVL_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for getting Energy Detection level.

    @return IEEE 802.15.4 energy detect level.
*/
__STATIC_INLINE uint8_t nrf_radio_ed_sample_get(void);
#endif // defined(RADIO_EDSAMPLE_EDLVL_Msk) || defined(__NRFX_DOXYGEN__)

#if defined(RADIO_CCACTRL_CCAMODE_Msk) || defined(__NRFX_DOXYGEN__)
/**
    @brief Function for configuring the IEEE 802.15.4 clear channel assessment.

    @param cca_mode           Mode of CCA.
    @param cca_ed_threshold   Energy Detection threshold value.
    @param cca_corr_threshold Correlator Busy Threshold.
    @param cca_corr_cnt       Limit of occurances above Correlator Threshold.
                             When not equal to zero the correlator based
                             signal detect is enabled.
*/
__STATIC_INLINE void nrf_radio_cca_configure(nrf_radio_cca_mode_t cca_mode,
                                             uint8_t              cca_ed_threshold,
                                             uint8_t              cca_corr_threshold,
                                             uint8_t              cca_corr_cnt);
#endif // defined(RADIO_CCACTRL_CCAMODE_Msk) || defined(__NRFX_DOXYGEN__)
                                             
/**
    @brief Function for setting power mode of the radio peripheral.

    @param[in] radio_power If radio should be powered on.
*/
__STATIC_INLINE void nrf_radio_power_set(bool radio_power);


#ifndef SUPPRESS_INLINE_IMPLEMENTATION

__STATIC_INLINE void nrf_radio_task_trigger(nrf_radio_task_t radio_task)
{
    *((volatile uint32_t *)((uint8_t *)NRF_RADIO + radio_task)) = 0x1UL;
}

__STATIC_INLINE uint32_t nrf_radio_task_address_get(nrf_radio_task_t radio_task)
{
    return ((uint32_t)NRF_RADIO + (uint32_t)radio_task);
}

__STATIC_INLINE void nrf_radio_event_clear(nrf_radio_event_t radio_event)
{
    *((volatile uint32_t *)((uint8_t *)NRF_RADIO + radio_event)) = 0x0UL;
    #if __CORTEX_M == 0x04
    volatile uint32_t dummy = *((volatile uint32_t *)((uint8_t *)NRF_RADIO + radio_event));
    (void)dummy;
    #endif
}

__STATIC_INLINE bool nrf_radio_event_check(nrf_radio_event_t radio_event)
{
    return (bool) * ((volatile uint32_t *)((uint8_t *)NRF_RADIO + radio_event));
}

__STATIC_INLINE uint32_t nrf_radio_event_address_get(nrf_radio_event_t radio_event)
{
    return ((uint32_t)NRF_RADIO + (uint32_t)radio_event);
}

__STATIC_INLINE void nrf_radio_shorts_enable(uint32_t radio_shorts_mask)
{
    NRF_RADIO->SHORTS |= radio_shorts_mask;
}

__STATIC_INLINE void nrf_radio_shorts_disable(uint32_t radio_shorts_mask)
{
    NRF_RADIO->SHORTS &= ~radio_shorts_mask;
}

__STATIC_INLINE void nrf_radio_shorts_set(uint32_t radio_shorts_mask)
{
    NRF_RADIO->SHORTS = radio_shorts_mask;
}

__STATIC_INLINE uint32_t nrf_radio_shorts_get(void)
{
    return NRF_RADIO->SHORTS;
}

__STATIC_INLINE void nrf_radio_int_enable(uint32_t radio_int_mask)
{
    NRF_RADIO->INTENSET = radio_int_mask;
}

__STATIC_INLINE void nrf_radio_int_disable(uint32_t radio_int_mask)
{
    NRF_RADIO->INTENCLR = radio_int_mask;
}

__STATIC_INLINE bool nrf_radio_int_enable_check(nrf_radio_int_mask_t radio_int_mask)
{
    return (bool)(NRF_RADIO->INTENSET & radio_int_mask);
}

__STATIC_INLINE bool nrf_radio_crc_status_check(void)
{
    return ((NRF_RADIO->CRCSTATUS & RADIO_CRCSTATUS_CRCSTATUS_Msk) >> RADIO_CRCSTATUS_CRCSTATUS_Pos)
           == RADIO_CRCSTATUS_CRCSTATUS_CRCOk ;
}

__STATIC_INLINE uint8_t nrf_radio_rxmatch_get(void)
{
    return (uint8_t)NRF_RADIO->RXMATCH;
}

__STATIC_INLINE uint32_t nrf_radio_rxcrc_get(void)
{
    return NRF_RADIO->RXCRC;
}

__STATIC_INLINE uint8_t nrf_radio_dai_get(void)
{
    return (uint8_t)NRF_RADIO->DAI;
}

#if defined(RADIO_PDUSTAT_PDUSTAT_Msk)
__STATIC_INLINE uint8_t nrf_radio_pdustat_get(void)
{
    return (uint8_t)(NRF_RADIO->PDUSTAT & RADIO_PDUSTAT_PDUSTAT_Msk);
}

__STATIC_INLINE uint8_t nrf_radio_cistat_get(void)
{
    return (uint8_t)((NRF_RADIO->PDUSTAT & RADIO_PDUSTAT_CISTAT_Msk) >> RADIO_PDUSTAT_CISTAT_Pos);
}
#endif // defined(RADIO_PDUSTAT_PDUSTAT_Msk)

__STATIC_INLINE void nrf_radio_packetptr_set(const void *p_packet)
{
    NRF_RADIO->PACKETPTR = (uint32_t)p_packet;
}

